Revit 2027 API
ParameterTypeId.ObjectStyleMaterialIdParam Property
 "Object Style Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ObjectStyleMaterialIdParam { get; }
Public Shared ReadOnly Property ObjectStyleMaterialIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ObjectStyleMaterialIdParam {
	ForgeTypeId^ get ();
}
static member ObjectStyleMaterialIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace